xml/InformationRegisters/ИИА_Чанки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_Чанки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хэш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИндекса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КлючЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/ИИА_ТокенИндекс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_ТокенИндекс</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>TF</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/InformationRegisters/ИИА_СтатусИндексаRAG.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИИА_СтатусИндексаRAG</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/CommonModules/ИИА_RAG_Индексатор/Ext/Module.bsl
// Модуль для построения индекса метаданных

// Процедура перестраивает индекс целиком
Процедура ПерестроитьИндекс() Экспорт
	
	// 1) Очистка старых данных
	ОчиститьИндекс();
	
	// 2) Подготовка
	СтопСлова = ИИА_RAG_Настройки.ПолучитьСтопСлова();
	
	// Статистика DF (Document Frequency) - сколько чанков содержит токен
	DF = Новый Соответствие; // Токен -> Число
	ВсегоЧанков = 0;
	ДатаИндекса = ТекущаяДата();
	НаборЧанков = РегистрыСведений.ИИА_Чанки.СоздатьНаборЗаписей();
	НаборТокенов = РегистрыСведений.ИИА_ТокенИндекс.СоздатьНаборЗаписей();
	
	// 3) Обход метаданных
	ИндексироватьОбъекты("Document", Метаданные.Документы, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
	ИндексироватьОбъекты("Catalog", Метаданные.Справочники, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
	ИндексироватьРегистры("AccumReg", Метаданные.РегистрыНакопления, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
	ИндексироватьРегистры("InfoReg", Метаданные.РегистрыСведений, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
	ИндексироватьПеречисления(DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
	
	// 4) Пакетная запись индекса
	НаборЧанков.Записать(Истина);
	НаборТокенов.Записать(Истина);
	
	// 5) Расчет IDF и запись статистики
	ЗаписатьСтатистику(DF, ВсегоЧанков);
	
	// 6) Обновление статуса
	ОбновитьСтатусИндекса();
	
КонецПроцедуры

// Очищает все регистры индекса
Процедура ОчиститьИндекс()
	
	РегистрыСведений.ИИА_Чанки.СоздатьНаборЗаписей().Записать(Истина);
	РегистрыСведений.ИИА_ТокенИндекс.СоздатьНаборЗаписей().Записать(Истина);
	РегистрыСведений.ИИА_ТокенСтатистика.СоздатьНаборЗаписей().Записать(Истина);
	
КонецПроцедуры

// Индексирует коллекции объектов (Документы, Справочники)
Процедура ИндексироватьОбъекты(ТипСтр, Коллекция, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса)
	
	Для каждого ОбъектМД Из Коллекция Цикл
		
		Имя = ОбъектМД.Имя;
		Синоним = ОбъектМД.Синоним;
		Путь = ТипСтр + "." + Имя;
		
		// 1. Header chunk
		ТекстHeader = "тип " + ТипСтр + " имя " + Имя + " синоним " + Синоним;
		// Добавляем ключевые слова для прямого совпадения (напр. "реализация" для "Расходная накладная")
		НормИмя = ИИА_RAG_Текст.Нормализовать(Имя);
		НормСиноним = ИИА_RAG_Текст.Нормализовать(Синоним);
		РасширяющиеКлючи = ИИА_RAG_Настройки.ПолучитьРасширяющиеКлючиДляИндекса(НормИмя, НормСиноним);
		Для каждого Ключ Из РасширяющиеКлючи Цикл
			ТекстHeader = ТекстHeader + " " + Ключ;
		КонецЦикла;
		ЗаписатьЧанк(ТипСтр, Имя, Синоним, Путь, "header", ТекстHeader, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
		
		// 2. Attributes chunk
		ТекстAttrs = "реквизиты ";
		Для каждого Реквизит Из ОбъектМД.Реквизиты Цикл
			ТекстAttrs = ТекстAttrs + Реквизит.Имя + " " + Реквизит.Синоним + " ";
		КонецЦикла;
		
		Если ОбъектМД.Реквизиты.Количество() > 0 Тогда
			ЗаписатьЧанк(ТипСтр, Имя, Синоним, Путь, "attrs", ТекстAttrs, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
			Для каждого Реквизит Из ОбъектМД.Реквизиты Цикл
				ТекстПоля = "поле " + Реквизит.Имя + " синоним " + Реквизит.Синоним + " объект " + ТипСтр + "." + Имя;
				ЗаписатьЧанк(ТипСтр, Имя, Синоним, Путь, "field_" + Реквизит.Имя, ТекстПоля, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
			КонецЦикла;
		КонецЕсли;
		
		// 3. Tabular sections chunk
		ТекстTab = "табличные части ";
		Для каждого ТЧ Из ОбъектМД.ТабличныеЧасти Цикл
			ТекстTab = ТекстTab + ТЧ.Имя + " " + ТЧ.Синоним + " ";
			Для каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
				ТекстTab = ТекстTab + РеквизитТЧ.Имя + " " + РеквизитТЧ.Синоним + " ";
			КонецЦикла;
		КонецЦикла;
		
		Если ОбъектМД.ТабличныеЧасти.Количество() > 0 Тогда
			ЗаписатьЧанк(ТипСтр, Имя, Синоним, Путь, "tab", ТекстTab, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Индексирует регистры
Процедура ИндексироватьРегистры(ТипСтр, Коллекция, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса)
	
	Для каждого ОбъектМД Из Коллекция Цикл
		
		Имя = ОбъектМД.Имя;
		Синоним = ОбъектМД.Синоним;
		Путь = ТипСтр + "." + Имя;
		
		Текст = "тип " + ТипСтр + " имя " + Имя + " синоним " + Синоним + " ";
		НормИмя = ИИА_RAG_Текст.Нормализовать(Имя);
		НормСиноним = ИИА_RAG_Текст.Нормализовать(Синоним);
		РасширяющиеКлючи = ИИА_RAG_Настройки.ПолучитьРасширяющиеКлючиДляИндекса(НормИмя, НормСиноним);
		Для каждого Ключ Из РасширяющиеКлючи Цикл
			Текст = Текст + Ключ + " ";
		КонецЦикла;
		
		Текст = Текст + "измерения ";
		Для каждого Изм Из ОбъектМД.Измерения Цикл
			Текст = Текст + Изм.Имя + " " + Изм.Синоним + " ";
			ТекстПоля = "измерение " + Изм.Имя + " синоним " + Изм.Синоним + " объект " + ТипСтр + "." + Имя;
			ЗаписатьЧанк(ТипСтр, Имя, Синоним, Путь, "field_" + Изм.Имя, ТекстПоля, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
		КонецЦикла;
		
		Текст = Текст + "ресурсы ";
		Для каждого Рес Из ОбъектМД.Ресурсы Цикл
			Текст = Текст + Рес.Имя + " " + Рес.Синоним + " ";
			ТекстПоля = "ресурс " + Рес.Имя + " синоним " + Рес.Синоним + " объект " + ТипСтр + "." + Имя;
			ЗаписатьЧанк(ТипСтр, Имя, Синоним, Путь, "field_" + Рес.Имя, ТекстПоля, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
		КонецЦикла;
		
		Текст = Текст + "реквизиты ";
		Для каждого Рек Из ОбъектМД.Реквизиты Цикл
			Текст = Текст + Рек.Имя + " " + Рек.Синоним + " ";
			ТекстПоля = "реквизит " + Рек.Имя + " синоним " + Рек.Синоним + " объект " + ТипСтр + "." + Имя;
			ЗаписатьЧанк(ТипСтр, Имя, Синоним, Путь, "field_" + Рек.Имя, ТекстПоля, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
		КонецЦикла;
		
		ЗаписатьЧанк(ТипСтр, Имя, Синоним, Путь, "reg", Текст, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
		
	КонецЦикла;
	
КонецПроцедуры

// Индексирует перечисления
Процедура ИндексироватьПеречисления(DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса)
	
	Для каждого ОбъектМД Из Метаданные.Перечисления Цикл
		
		Имя = ОбъектМД.Имя;
		Синоним = ОбъектМД.Синоним;
		Путь = "Enum." + Имя;
		
		Текст = "тип перечисление имя " + Имя + " синоним " + Синоним + " значения ";
		Для каждого Значение Из ОбъектМД.ЗначенияПеречисления Цикл
			Текст = Текст + Значение.Имя + " " + Значение.Синоним + " ";
		КонецЦикла;
		
		ЗаписатьЧанк("Enum", Имя, Синоним, Путь, "enum", Текст, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса);
		
	КонецЦикла;
	
КонецПроцедуры

// Записывает чанк и обновляет инвертированный индекс
Процедура ЗаписатьЧанк(Тип, Имя, Синоним, Путь, Суффикс, ТекстИсх, DF, ВсегоЧанков, СтопСлова, НаборЧанков, НаборТокенов, ДатаИндекса)
	
	КлючЧанка = СформироватьКлючЧанка(Тип, Имя, Суффикс);
	
	НормТекст = ИИА_RAG_Текст.Нормализовать(ТекстИсх);
	Токены = ИИА_RAG_Текст.Токенизировать(НормТекст, СтопСлова);
	
	Если Токены.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Запись чанка в пакетный набор
	ЗаписьЧанка = НаборЧанков.Добавить();
	ЗаписьЧанка.КлючЧанка = КлючЧанка;
	ЗаписьЧанка.Тип = Тип;
	ЗаписьЧанка.Имя = Имя;
	ЗаписьЧанка.Синоним = Синоним;
	ЗаписьЧанка.Путь = Путь;
	ЗаписьЧанка.Текст = Новый ХранилищеЗначения(НормТекст);
	ЗаписьЧанка.Длина = СтрДлина(НормТекст);
	ЗаписьЧанка.Хэш = ИИА_RAG_Текст.ПолучитьХэш(НормТекст);
	ЗаписьЧанка.ДатаИндекса = ДатаИндекса;
	
	ВсегоЧанков = ВсегоЧанков + 1;
	
	// 2. Подсчет TF (Term Frequency)
	TFMap = Новый Соответствие;
	Для каждого Токен Из Токены Цикл
		ТокенИндекса = НормализоватьТокенИндекса(Токен);
		Если ПустаяСтрока(ТокенИндекса) Тогда
			Продолжить;
		КонецЕсли;
		TFMap.Вставить(ТокенИндекса, ?(TFMap[ТокенИндекса] = Неопределено, 1, TFMap[ТокенИндекса] + 1));
	КонецЦикла;
	
	// 3. Запись в инвертированный индекс в пакетный набор
	Для каждого Пара Из TFMap Цикл
		
		Токен = Пара.Ключ;
		TF = Пара.Значение;
		
		НоваяЗапись = НаборТокенов.Добавить();
		НоваяЗапись.Токен = Токен;
		НоваяЗапись.КлючЧанка = КлючЧанка;
		НоваяЗапись.TF = TF;
		
		// Обновляем Document Frequency (DF)
		DF.Вставить(Токен, ?(DF[Токен] = Неопределено, 1, DF[Токен] + 1));
		
	КонецЦикла;
	
КонецПроцедуры

Функция НормализоватьТокенИндекса(Токен)
	
	Возврат НРег(СокрЛП(Лев(Строка(Токен), 64)));
	
КонецФункции

Функция СформироватьКлючЧанка(Тип, Имя, Суффикс)
	
	ИсходныйКлюч = Тип + "|" + Имя + "|" + Суффикс;
	Если СтрДлина(ИсходныйКлюч) <= 72 Тогда
		Возврат ИсходныйКлюч;
	КонецЕсли;
	
	Хэш = ИИА_RAG_Текст.ПолучитьХэш(ИсходныйКлюч);
	Возврат Лев(ИсходныйКлюч, 55) + "|" + Лев(Хэш, 16);
	
КонецФункции

// Рассчитывает IDF и записывает статистику по токенам
Процедура ЗаписатьСтатистику(DF, ВсегоЧанков)
	
	Если ВсегоЧанков = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Используем соответствие для дедупликации после обрезки длины и приведения к нижнему регистру
	СтатистикаДляЗаписи = Новый Соответствие;
	
	Для каждого Пара Из DF Цикл
		
		Токен = НормализоватьТокенИндекса(Пара.Ключ);
		Если ПустаяСтрока(Токен) Тогда
			Продолжить;
		КонецЕсли;
		dfVal = Пара.Значение;
		
		// Если после нормализации токены совпали, суммируем их DF
		ТекущееЗначение = СтатистикаДляЗаписи[Токен];
		СтатистикаДляЗаписи.Вставить(Токен, ?(ТекущееЗначение = Неопределено, dfVal, ТекущееЗначение + dfVal));
		
	КонецЦикла;
	
	// Очищаем регистр перед записью новой статистики, чтобы избежать конфликтов со старыми данными
	РегистрыСведений.ИИА_ТокенСтатистика.СоздатьНаборЗаписей().Записать(Истина);
	
	Для каждого Пара Из СтатистикаДляЗаписи Цикл
		
		Токен = Пара.Ключ;
		dfVal = Пара.Значение;
		
		// Формула IDF для BM25: log((N - df + 0.5) / (df + 0.5) + 1)
		idfVal = Log((ВсегоЧанков - dfVal + 0.5) / (dfVal + 0.5) + 1);
		
		МенеджерЗаписи = РегистрыСведений.ИИА_ТокенСтатистика.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Токен = Токен;
		МенеджерЗаписи.DF = dfVal;
		МенеджерЗаписи.IDF = idfVal;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Обновляет информацию о последней сборке индекса
Процедура ОбновитьСтатусИндекса()
	
	МенеджерЗаписи = РегистрыСведений.ИИА_СтатусИндексаRAG.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяКонфигурации = Метаданные.Имя;
	МенеджерЗаписи.ДатаСборки = ТекущаяДата();
	МенеджерЗаписи.ВерсияКонфигурации = Метаданные.Версия;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
